<?php 
/*
=====================================================
 Cron - automizes your life!
-----------------------------------------------------
 https://Foxesworld.ru/
-----------------------------------------------------
 Copyright (c) 2016-2020  FoxesWorld
-----------------------------------------------------
 Данный код защищен авторскими правами
-----------------------------------------------------
 Файл: cron.php
-----------------------------------------------------
 Версия: 0.0.4 Alpha
-----------------------------------------------------
 Назначение: Работы для кронтаба
=====================================================
*/
define('INCLUDE_CHECK',true);
Error_Reporting(E_ALL);
Ini_Set('display_errors', true);
require ('../database.php');
//================================================================
	$key = $_GET['key'] ?? null;
	if($key == $cronPass){
	//===========Running CronTab Jobs==================
		clearMD5Cache($LauncherDB);
	
	//=================================================
	} else {
		require ('../../index.html');
	}

