<?php
/*
=====================================================
 ImageHash
-----------------------------------------------------
 https://arcjetsystems.ru/
-----------------------------------------------------
 Copyright (c) 2016-2019 FeniumCraft
-----------------------------------------------------
 Данный код защищен авторскими правами
-----------------------------------------------------
 Файл: images.php
-----------------------------------------------------
 Версия: 0.0.3 Alpha
-----------------------------------------------------
 Назначение: Проверка хеша картинок
=====================================================
*/ 
header("Content-Type: text/plain; charset=UTF-8");
$get_request =  $_SERVER['QUERY_STRING'];

	if ($get_request){
		$file_link = "../files/img/$get_request.png";
		if(file_exists($file_link)){
		$hash = md5_file($file_link);
		die("$hash");
	} else {die("Hacking Attempt!");}
	} else {
		die("Hacking Attempt!");
	}
?>