<?php
/*
=====================================================
 Radio PDO
-----------------------------------------------------
 https://arcjetsystems.ru/
-----------------------------------------------------
 Copyright (c) 2016-2019 Foxesworld
-----------------------------------------------------
 Данный код защищен авторскими правами
-----------------------------------------------------
 Файл: radio.php
-----------------------------------------------------
 Версия: 0.0.5 Alpha
-----------------------------------------------------
 Назначение: Вывод списка радиостанций в лаунчере
=====================================================
*/ 
	$DBH = new PDO("mysql:host=$db_host;dbname=$dbname;charset=UTF8", $db_user, $db_pass); 
	$STH = $DBH->query('SELECT * FROM radio');  
	$STH->setFetchMode(PDO::FETCH_OBJ);  

	while($row = $STH->fetch()) {  
		echo $row->id . "\n";  
		echo $row->radio_name . "\n";  
		echo $row->radio_adress . "\n";
		echo $row->radio_mount . "\n";	
	}
	$STH = null;
?>